Openbeetles/beetles/sdkconfig.defaults.esp32p4
# beetle - ESP32-P4 target
CONFIG_IDF_TARGET="esp32p4"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# ESP32-P4-NANO ships 32MB PSRAM. Keep the same Beetle allocator posture as S3:
# large network/TLS buffers may live in PSRAM, but stacks and DMA stay internal.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=32
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MEMTEST=n

# Hosted wireless on P4 is provided by the on-board ESP32-C6 via esp_wifi_remote/esp_hosted.
# This keeps the same upper-layer WiFi contract (scan + SoftAP + STA) without making
# Beetle itself run on the C6.
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y

CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
# Keep ESP TLS heap recovery aligned with S3 and ESP-IDF dynamic-buffer examples.
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y

# CONFIG_HTTPD_WS_SUPPORT is not set
# CONFIG_ESP_GDBSTUB_ENABLED is not set
CONFIG_LOG_TAG_LEVEL_IMPL_NONE=y
# CONFIG_LOG_DYNAMIC_LEVEL_CONTROL is not set
# CONFIG_LOG_IN_IRAM is not set
# CONFIG_MBEDTLS_ERROR_STRINGS is not set
CONFIG_MBEDTLS_X509_REMOVE_INFO=y
CONFIG_MBEDTLS_PK_WRITE_C=y
# CONFIG_MBEDTLS_X509_CRL_PARSE_C is not set
# CONFIG_MBEDTLS_X509_CSR_PARSE_C is not set
CONFIG_MBEDTLS_TLS_CLIENT_ONLY=y
# CONFIG_MBEDTLS_SSL_CACHE_C is not set
# CONFIG_MBEDTLS_SSL_RENEGOTIATION is not set
# CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS is not set
# CONFIG_MBEDTLS_SERVER_SSL_SESSION_TICKETS is not set

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../../../../../../partitions_p4_16mb.csv"

CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60
